In [3]:
import pandas as pd

# Crear DataFrame de ejemplo
data = {
    'Nombre': ['Jose', 'Camila', 'Carlos', 'Lorena'],
    'Edad': [25, 30, 21, 28],
    'Sexo': ['M', 'F', 'M', 'F'],
    'Clase': ['A', 'B', 'A', 'C']
}

df = pd.DataFrame(data)

# Subconjunto 1: Nombre con Edad
subset1 = df[['Nombre', 'Edad']]

# Subconjunto 2: Sexo con Nombre y Clase
subset2 = df[['Sexo', 'Nombre', 'Clase']]

# Visualizaci√≥n de los subconjuntos
print("Subconjunto 1 - Nombre con Edad:")
display(subset1.head())

print("\nSubconjunto 2 - Sexo con Nombre y Clase:")
display(subset2.head())

Subconjunto 1 - Nombre con Edad:

   Nombre  Edad
0    Jose    25
1  Camila    30
2  Carlos    21
3  Lorena    28

Subconjunto 2 - Sexo con Nombre y Clase:

  Sexo  Nombre Clase
0    M    Jose     A
1    F  Camila     B
2    M  Carlos     A
3    F  Lorena     C